In [12]:
import pandas as pd
from scipy.stats import kurtosis

In [4]:
df = pd.read_excel("data.xlsx",sheet_name='Amount')
df.shape

(350, 1)

In [7]:
sales = pd.read_excel("Sales_data.xlsx")
sales

  Deal     SP1     SP2     SP3
0   D1  145000  105000   65000
1   D2   25000  110000   45000
2   D3  300000  125000   70000
3   D4   43000  110000  150000
4   D5   55000  118000  238000

In [8]:
sales.describe()

                 SP1            SP2            SP3
count       5.000000       5.000000       5.000000
mean   113600.000000  113600.000000  113600.000000
std    114016.665449    7893.034904   80263.939599
min     25000.000000  105000.000000   45000.000000
25%     43000.000000  110000.000000   65000.000000
50%     55000.000000  110000.000000   70000.000000
75%    145000.000000  118000.000000  150000.000000
max    300000.000000  125000.000000  238000.000000

In [13]:
df

     Fr & Veg
0         625
1         354
2         577
3         570
4         664
..        ...
345       297
346       503
347       526
348       430
349       580

[350 rows x 1 columns]

In [15]:
kurtosis(df['Fr & Veg'],bias=False)

-0.1135910016091195

In [16]:
df.kurtosis()

Fr & Veg   -0.113591
dtype: float64